#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.ct_config.ignition will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "ignition" {
      + content      = (known after apply)
      + files_dir    = "./.."
      + id           = (known after apply)
      + pretty_print = false
      + rendered     = (known after apply)
      + strict       = true
    }

  # null_resource.regenerate_key must be replaced
-/+ resource "null_resource" "regenerate_key" {
      ~ id       = "5790980948779046849" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "bootstrap_config_hash" = "418feaeb0e16886a5687d38230a352b1f7af3d1d0166c0024a1c2db9d02b7ecc" -> "37733c90b364cea9e32cf4a25f3dbc685b5f6ca9db15d2ea74e7825d8e36a871"
            # (11 unchanged elements hidden)
        }
    }

  # oci_core_instance.this must be replaced
-/+ resource "oci_core_instance" "this" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.uk-london-1.abwgiljtczcncqu62te3ikuh2fc5ynw3kkgcg7y2n2map7sog6kq2nfhq7vq" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/terraform" -> null
          - "Oracle-Tags.CreatedOn" = "2026-02-24T01:01:48.896Z" -> null
            # (3 unchanged elements hidden)
        }
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      + hostname_label                      = (known after apply)
      ~ id                                  = "ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acnmogcll3zc63p6yyihiupueffrdobd35gz5ezrjlv5vq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.uk-london-1.aaaaaaaaze7uoavoo7lblhkq4rzfclpwrrfoubqvqiprstvqtpvi4j4ymfka" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_ai_enterprise_enabled            = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "user_data" = "eyJpZ25pdGlvbiI6eyJjb25maWciOnsicmVwbGFjZSI6eyJ2ZXJpZmljYXRpb24iOnt9fX0sInByb3h5Ijp7fSwic2VjdXJpdHkiOnsidGxzIjp7fX0sInRpbWVvdXRzIjp7fSwidmVyc2lvbiI6IjMuNC4wIn0sImtlcm5lbEFyZ3VtZW50cyI6e30sInBhc3N3ZCI6e30sInN0b3JhZ2UiOnsiZGlyZWN0b3JpZXMiOlt7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvcmVwbyIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9lbnYiLCJ1c2VyIjp7fSwibW9kZSI6NDkzfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cyIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9vY2ktdmF1bHQiLCJ1c2VyIjp7fSwibW9kZSI6NDQ4fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvcmNsb25lIiwidXNlciI6e30sIm1vZGUiOjQ0OH0seyJncm91cCI6e30sInBhdGgiOiIvZXRjL2J1Y2tldCIsInVzZXIiOnt9LCJtb2RlIjo0NDh9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zZWNyZXRzIiwidXNlciI6e30sIm1vZGUiOjQ0OH1dLCJmaWxlcyI6W3siZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy90bXBmaWxlcy5kL29jaS1hcHBzLmNvbmYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixkJTIwJTJGcnVuJTJGc2VjcmV0cyUyMDA3MDAlMjByb290JTIwcm9vdCUyMC0lMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvbG9jYWxlLmNvbmYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixMQU5HJTNEQy5VVEYtOCUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy96aW5jYXRpL2NvbmZpZy5kLzU1LXVwZGF0ZS1zdHJhdGVneS50b21sIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvelROTWFyRE1BeUE0VjJuRUpvZndhOTBLbVR0MXFtRkRzRUVVNHRFME5qQmxnbTVmVkVnMDRlRTBEKzBOUWJsNnFGcUNjclRqajNTeWtWeWxBOEJET2RGZHk2N1RWTE1tL2NRdzE2eHh3SHBrUlA5SWIwYUcyK094elEzNDE3RWVBWTlhSW5RYXFIb3FMS3c5ZHoxNWh6Qmw5T2s4N2hJYXNyMitmL2k0QmNBQVAvLytxMmRnS0lBQUFBPSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9vY2ktdmF1bHQvY29uZmlnIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvNXpQdTI2c01CZ0U0SDdmWlpFNDNLcFRyQWdGMGlxSmdDUWwrckh4d21MOFkrTWJmdm9vU1JtbDJhbEcwM3lhOTh2YnRldmJxbXlxcnErZit2SmFWODlmN1QrU21jYVJCY1AxUGhJMTZnaEpISm5sekZGUUZPYzRnaFcrNC9nVW9BREFrSkdKU2o1NkE4ZU5IRXNXRHBxendTU1UwWDNMQlIrVWRXWXVWQWFuUCtDZjRRRThHelZMdVZiclBkejlNQk1aN0N3S1NLWjEwNGovVE02VWwrWW1DcmZLWDNoVHRWMWQ5cStYdHYxNGFSNzVubkxuV0lGcTJJR2d0WDR4ZHRpTlRBUkpOM0JlemNFak9jTENmQzVQbndFQUFQLy83dHplNUhVQkFBQT0iLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6Mzg0fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvcmNsb25lL3JjbG9uZS5jb25mIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosJTVCb2NpLWJhY2t1cCU1RCUwQXR5cGUlMjAlM0QlMjBvcmFjbGVvYmplY3RzdG9yYWdlJTBBcHJvdmlkZXIlMjAlM0QlMjBpbnN0YW5jZV9wcmluY2lwYWxfYXV0aCUwQW5hbWVzcGFjZSUyMCUzRCUyMGxya3kwZjFubW90cyUwQXJlZ2lvbiUyMCUzRCUyMHVrLWxvbmRvbi0xJTBBbm9fY2hlY2tfYnVja2V0JTIwJTNEJTIwdHJ1ZSUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjozODR9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9idWNrZXQvY29uZmlnIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosQlVDS0VUX05BTUUlM0RvY2ktYXBwcyUwQU9DSV9OQU1FU1BBQ0UlM0Rscmt5MGYxbm1vdHMlMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6Mzg0fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cy9maXJzdC1ib290LnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvM3lSd1dvYlFReUc3L3NVcXR0VFlYWVBLUTBVU2cvdXhSQUlOTDJGWU1hejJ0MGhNeU5WMHJweHlNT1gzY1IyV0V4dmcvVFBKL0hwNDRkbUYwdXo4enBVaWdZT1J3S09qSjJQcWFvd0RBU3JuL1MzSlBKdExEMzg5akZwOEFucnVsNVZZWlFFcnRPN0d4ak1XTDgxRFQvMld0c3BGU2czYW42WHNEa1Z0OGticW0yOTVLOWZhdXVmd1JFMGx2a2NtYXFWZVFIMzlOeGQ2SUZiejlVcThLSzcvWHgrLzZmVlFqT3FOSW1DVDdPQ1NqSTR1VGhyU1huVGNsSUJzYWo1TkVHTmx0elYwZUxtTlRSSjVJTU5WSzRjUjU0MUNtZEhhb0luRkRqbm1kUEJwYmpIOS9rTHROdjFCdFkzRy9DbEJhWTIrK0lDWlNaOXZSRkh2bnFIWmNFdVBuMC9id2tVb2dzcEx2NGVCNjBIREkvVG1JNEVidTlnNUhhNjNuTHZrWHZ4TGNMTEM5emZ3NmNmNFBBUFhGL0R3OE1SOUFzejdTY1FNUmJWd1NuS0htVUpvajJLeEJaQnBqd3UwbWZZanNnbW1oSE1waUFNdnZSdmkrbEJEWE93QkRJSHEzOEJBQUQvL3hDYzM1dm9BZ0FBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZmV0Y2gtY29uZmlnLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvNFJWYlcvYk5oZjl6bDl4SDBiQWs3U1ZsSFRmMm5tRG0yWllzYlFOMGhUWXNBMEdSVjFaZDZaSWxyeEs0aFg5NzRQZWJMbElrRThXRHc4UDc4dmg5ZEgvOG9Kc1hxaFlpNGdNS2JZT1BIbXNGQmtoM2k5L1h5MXZiaTdlWDkxOFdydzhGVzh2THBkL0xINDRGVzgrbi85MmNiUDZzSHgvc1pESm1ad0RuNjZXNXgzNlVvcnU1T3J0dSt1RnpMbnh1ZE9VYW1jcldxZWx1N1BHcVZLSzY0dXJqNnZQMTVjTFdUUDcrQ3JQMThSMVcyVGFOWG1obUN4cDlXOS9Wbmtmc3pYeGVHZ1FkcDd6Z043dEdPUHVtK3ZsaC9OZkY3SlJaS1VRMDRXck8rSjZGWkFEWVR3K2dhOEN3RGl0RFBpQUZkMHZrck1kVW1Ma1JmSnl0MWJNMkhoZW5Ba0IwR3hLQ3BCNmtFbkhrd0lnTkpDR0NtUXk1UzBQZVh0WUFOelZaQkNPanlkVitIRUI4M3JEeWNscktKMEFBRUJkTzVETGtaaU1KL0prem44RmI4Y1V5YTRoR2JJQmRqQ0cxd3QxUFg2Ty9hZlRCQzZDSy81QnpWQzBack5yQ3Z6Vk13RFNWTFZjQTluSXltcGMrVUJXazFkbXhyQ3F3ZWlWUnBESjl5NlFNMTdSNmcxeVR6OWt6a2xqMUhJTWY3NDFCWmQyNVp6VmNrWnh0eGp1QXZHUTROQ3p5SXJidUVoKzN1V2Y0bEFMcXVCUFNJWjlTUEVMbk1MZnI0RnJ0S05nVDBqTDJXWDVMcTVESm9EMmtJYUhtTTlHZitSeTVGWTBmanpvbG40RHVRMFdUc1ZJbjZLZGVlV25CN3d5aTJmd3l5K0tESmFnS3NZQUIxNlpkT0owSmQ0VHc5bkJoWVBHNUNtb2VyRVhYWEJoMnptTUxDUmYrNEh3TFdaWk5paEZnK2doNmVFZTJNZjgvRG1jbkFpQTBsa1UzNFFZWTBUV2RTYzN6SVUyS0Nabm9RcXVnWS9uNzJCd1RhLy84Qk1HT1p6TXY3U3FOTWd4bHlCelpKMXJaMW1SeFJEenVJMk1UU21ma0JocE80VnBQZncrZFpwc1JaRzBNdU9NNjJXQ2M1eG4zek9la3VLZ3NLTE5vMExqL2xNeXFtVVhNRExwUjVYMkZEbTE1Tnc0MjNWRWVXOUlELzNvQm13a2RtSGJ0MkkyMDQ1TEN1T2Jub2F5UEpGaVRRemFPSXZkeTBYUE5aeDFNeUFvcSt1Sk9reG9PUzAvWDEvS3VZb3dGdEk0UTJZZGxkRFAvVDBnUkplRkM2aWRoZlFhSG5IQVE2ekRMZ3N4L0dvMlVDcHNuRTBEZGlXZWI2QlZoZWxTcys2dW56OVZ3RmlIR0RPdnVPNFJiNVRkcVAzYUVqT0cvVHBnYWFqWXI0Mnk2MWF0a1owemUxUjVueFpLYjFxZk1UVVlkcUFQcmNVWnRpWjJQcVp4YS9XQUNuRUVsNlBtalhNR2FoWEJPbmczZVJBaTZvQWNYMEIwMEZwREd3VEhOUWFJR0c1Sll3Uml1SFAyL3d3RmlpUGdRT3MxQml5aDJJS0NJY2pXZGlRMVB1SytLYU51L2l4RGU1dkJKMWFCTzZtU0FtbzIyMHdjOVpWTEMrUDBCdFN0b3pKQ3YrZzB1RVlvbkdQUXRTSTcvazFlM0tQdWhhNEN3bVQ2Q0hZZFZCT3p4em96dStXZ3ZHT0NPOE1manA1dUlvRjJqVGZJS01WL0FRQUEvLy9PVWF1bUl3a0FBQT09IiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZmV0Y2gtYm9vdHN0cmFwLXNlY3JldHMuc2giLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiJnemlwIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LEg0c0lBQUFBQUFBQy83eVVRVzhhUHhERjcvNFU4MS9RUDhuQjBGWlZjNmdhS2FKRVFvcWFDaWc1cEJIeTJyUHNpRjE3YTQ5THFmancxV1ozYVFtVmNxSW4wSGplNzgwYlc5djdiNWlTSGFZcTVDSWdnOFRvb0tJS00wV0ZFRDI0UWRZNUJOUWVPVUFNWkZkQU5yQ3lHcUh5WkRWVnFvQno2MEI3TkdpWlZCSEFJaG8wRjJKME94bC9taThuSHovMHo1Mm1QYWo1bFdtMHBrQllJY05YQVNDbGlwenYrY3ZmL09hMFZaR0JwTCs0L25JN1g4N0dvK200NWkvM1RrbmIvQzJpMzhLWlVhd0d5WUdmMU00eVdrNEc3Wit6VnVMVlJycklWV1RZUWFvQ3Zuc0wwbHlJTGtiajlxK2lOSVZUeEptT1ovUEphUG41ZWphN3Y1dWUvbTZlK1owaVVnOFdxaUNqR1BjNU51Z1JzdnI5b2hHVXdjTUR5SitROVA5NEtidmRRYW5iZUZjK212dng4VDF3amxZQUFLRE9IU1EzaWdvMHdLNngycnRuM3BWd041ckFRc1dDRTdqNi8wMmora0VNcjBWRzljejNuaGhyYlltbDgxdVpLcjJ1WVdXVkJkZ1FQK0dpUjZqUWx4UUNPZHVTT1VjSXJEeUxXS3F3aGxlWGw2SmNHL0lnS3hqNmFJZnRJT0pwVEdrUGcxOGQ5QXpKWmhSSXEwTHFndERXMTNpczY3Ynprclk1RUEzZ0wwdDhwdmNZbUxTc1ZBZ2I1MDJubTlYaG1xOU54MWNydER3WURCSVJ0b0d4MUZ3ME93QXByWk5wNGZUNnFEMmcvMDRhajdCenJ6Q2o5VXM0YnRzNnpLOEFBQUQvLzJPV01LRXhCUUFBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZ2l0b3BzLXN5bmMuc2giLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiJnemlwIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LEg0c0lBQUFBQUFBQy8yU1JVVy9UTUJTRjMvMHJUazJFbUlScm1NUUxxSk5LRitpa3NrN1o0R1ZDbGVkYzF4WnVITmxPMGNUNDd5akoxbzN0MmZkOFB0KzlyeWJ5eGpYeVJpWExFbVVJNmdKYTE1SlJ6ak5XbFJmcnplbFpOZU15dEZsR2FvTU0yZ25WdG9teno5WDhmTEdjOFoxeURXZkx4YVk4LzNFL21VaEh5a2xhVWo1YmJVbi9FbDMwYVVyTm5qT21hL0RpQWM3WjFtVVl5dG9pUkxkMURYZ3hzamxqcS9WaXZwb1ZiL3FaU0h2UnFwZ0l5M0orZXNTcTh0djZxbnp4eUVlS2ZJQWNNZVlNcnNHTEFjWXhtUTNmOTJHT241K1FMVFVNY0FZVDlLaTI4eDVDR0NOQzQyOWZsTUx4aWF4cEw1dk8rME1ZSUcwRCtCZVZzakFoL2xheFJyOUZxdC9DQjYwOHJFcW8zWjdpbG1xWUdIYjR2K2dVRlNYSzJUWGJLY2ZKNitNQk83b054eEcyaHo3WFk0Qnh6TGg3UzJIQWkvRVlUK1ZTNktLbXg2ZlI5eHFpRi91elhHeStubDJ0THk0MzM2dlZSL0gzYVJMUVhmUVFKbDFDN1BEK0hZU0lsT010UGtBRUhGWXhzaDh4SEhkM3lMR2pROEYvQVFBQS8vOE5NMzhpYmdJQUFBPT0iLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDkzfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cy9mcmVzaHJzcy1jYWNoZS13YXJtLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvNFNSMzAvaVRoVEYzK2V2T000WHJacnZkQURqQzRxSldlb3VXZDBmWXVLRDY1S0J1YVdOWmFZN00xVWk4TDl2S0lMNHRQZXBhYzQ5NTU3UC9MY25SN21SSStVejVpbEFVR1ZSNWlXbEtpOFk2MTNlWFE1Ny9kc3VsN1lNVXF1Z1pPcklaODU3T2JZbXpTZXk4dVE4WjRPZjEvMjdaTmkvdWZ5Y2RMbTI0eWR5Y1c2bEtzcmNrUFIvaWp4UTV5UStiY1Z0enRpRXdqQWwwdjd3Q0hNR0FHbHVOSGhqRThraHBtcW1xUXdaMmhCR1RRbVJIc1Zyb3doN0VLVUtHYUpqT1pUSEVVVHBjaE9hYUY5SVRjL1NWRVdCQlg3VjFpOVpYaEQ2VjRNdUhDa040U0Ewb2doNmRBWnRhODFxU3F1bnlzQlZCa0s0S2NRemVHT3VSOHVPM0NaM25QMy9sWU0zZGd2enQ2RE52TXZCQjhsMTh1a09sU3R3ZGZ2OUJxdld1UCtTM0NiMXYrdisxd1RSL2xROVVWb1ZSYUJaV0NuMkkvNnh5Z0xCVlZTbmFHdUlMUm03U3BMZW9OczQzTExFQXQ2NkFGRmhnWW1qRXRIdkxJUXkycXdmc1ljSGlGZndScjNMOGZpSWd3UE1RZVBNZ24rejJOemd2TWZhTTdXVjBmd01OTXNEbW1kWU1yWlczeXMzemMwRWpjT1hNVVNCOC9QenJmSFJlam1PWTg1WWFoMkd5QTNtclRnK2FTNjN6Tjk0MDR6R0g0TEhLekRDcDFnZDM1R3lzR05WWk5ZSG1SdE5zN2pNU3V5d2FWOGN0RlkxUm83VVUyM3NDNklTTFZhVFlqUGxKaDdpeHlsRWY3NzhWK3EwMVc2Q3o1Y2N3bUkzNVAxN3QrbjJaZDZvOUt3aHp2NEdBQUQvLzRGT2g1TllBd0FBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9mcmVzaHJzcy5lbnYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixGUkVTSFJTU19IT1NUJTNEcnNzLmRjdS5zaCUwQUZVTExURVhUUlNTX0hPU1QlM0RmdHIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9wbGFua2EuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosUExBTktBX0hPU1QlM0RwbGFua2EuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9uaXR0ZXIuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosTklUVEVSX0hPU1QlM0RuaXR0ZXIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9yZWRsaWIuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosUkVETElCX0hPU1QlM0RyZWRsaWIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9sYW5ndWFnZXRvb2wuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosTEFOR1VBR0VUT09MX0hPU1QlM0RsdC5kY3Uuc2glMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cy9sYW5ndWFnZXRvb2wtbmdyYW1zLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvMVRPVDBzRE1SQUY4UHQ4aWpHVzNtWm5LNGdpOUNEK1k2R0sxSnNpTW11eTIyQ2FoQ1NMeFU4dnVGSjJ6elB2dmQvcENiZldjeXQ1QjlrVUpETUVqRGFhVHF3RGVIcllYajkrM0RiYnRlSVFDMnNwd2s1OFAwaHZTZ2lPZlo5a254VzhOcy8zemVadXJSYkhERmZHVno4MktvQTNKSTNUay9FSzMzRzVSSE93Qld1QS9aZTJDU2xPdnhUQTU1QWNVdmV5UVFxb0Z2OHJDdFd1bEppdmVJYXBRdXBaaDIvdmd1aFJSbi9pRVVuRzAxbTlPcTh2VnhlanE4MjZTRUk2ZE5OdXVwa2pmZ01BQVAvL2c3VFE0U1FCQUFBPSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0OTN9XSwiZmlsZXN5c3RlbXMiOlt7ImRldmljZSI6Ii9kZXYvc2RiIiwiZm9ybWF0IjoieGZzIiwibGFiZWwiOiJhcHBzLWRhdGEiLCJwYXRoIjoiL3Zhci9vcHQvZGF0YSIsIndpcGVGaWxlc3lzdGVtIjpmYWxzZX1dfSwic3lzdGVtZCI6eyJ1bml0cyI6W3siY29udGVudHMiOiIjIEdlbmVyYXRlZCBieSBCdXRhbmVcbltVbml0XVxuUmVxdWlyZXM9c3lzdGVtZC1mc2NrQGRldi1zZGIuc2VydmljZVxuQWZ0ZXI9c3lzdGVtZC1mc2NrQGRldi1zZGIuc2VydmljZVxuXG5bTW91bnRdXG5XaGVyZT0vdmFyL29wdC9kYXRhXG5XaGF0PS9kZXYvc2RiXG5UeXBlPXhmc1xuXG5bSW5zdGFsbF1cblJlcXVpcmVkQnk9bG9jYWwtZnMudGFyZ2V0IiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6InZhci1vcHQtZGF0YS5tb3VudCJ9LHsiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6InBvZG1hbi5zb2NrZXQifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1GaXJzdCBib290IGluaXRpYWxpemF0aW9uICh1cGRhdGVzICsgU1NIIHJlbW92YWwpXG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXRcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuQ29uZGl0aW9uRmlyc3RCb290PXllc1xuXG5bU2VydmljZV1cblR5cGU9b25lc2hvdFxuRXhlY1N0YXJ0PS9vcHQvc2NyaXB0cy9maXJzdC1ib290LnNoXG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJmaXJzdC1ib290LnNlcnZpY2UifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1UYWlsc2NhbGUgRGFlbW9uXG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgZmlyc3QtYm9vdC5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblxuW1NlcnZpY2VdXG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FeGVjU3RhcnQ9L3Vzci9sb2NhbC9iaW4vdGFpbHNjYWxlZCAtLXN0YXRlPS92YXIvbGliL3RhaWxzY2FsZS90YWlsc2NhbGVkLnN0YXRlXG5SZXN0YXJ0PW9uLWZhaWx1cmVcblJlc3RhcnRTZWM9NVxuXG5bSW5zdGFsbF1cbldhbnRlZEJ5PW11bHRpLXVzZXIudGFyZ2V0XG4iLCJlbmFibGVkIjp0cnVlLCJuYW1lIjoidGFpbHNjYWxlZC5zZXJ2aWNlIn0seyJjb250ZW50cyI6IltVbml0XVxuRGVzY3JpcHRpb249QXV0aGVudGljYXRlIFRhaWxzY2FsZSAoaWYgbm90IGFscmVhZHkgYXV0aGVudGljYXRlZClcbkFmdGVyPW5ldHdvcmstb25saW5lLnRhcmdldCB0YWlsc2NhbGVkLnNlcnZpY2VcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuUmVxdWlyZXM9dGFpbHNjYWxlZC5zZXJ2aWNlXG5cbltTZXJ2aWNlXVxuVHlwZT1vbmVzaG90XG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FeGVjU3RhcnQ9L2Jpbi9iYXNoIC1jICdcXFxuICBpZiAvdXNyL2xvY2FsL2Jpbi90YWlsc2NhbGUgc3RhdHVzIC0tanNvbiAyXHUwMDNlL2Rldi9udWxsIHwgZ3JlcCAtcSBcIlxcXCJCYWNrZW5kU3RhdGVcXFwiOlxcXCJSdW5uaW5nXFxcIlwiOyB0aGVuIFxcXG4gICAgZWNobyBcIlRhaWxzY2FsZSBhbHJlYWR5IGF1dGhlbnRpY2F0ZWRcIjsgXFxcbiAgZWxzZSBcXFxuICAgIGVjaG8gXCJBdXRoZW50aWNhdGluZyBUYWlsc2NhbGUuLi5cIjsgXFxcbiAgICAvdXNyL2xvY2FsL2Jpbi90YWlsc2NhbGUgdXAgLS1hdXRoLWtleT1cInRza2V5LWF1dGgta280RXZySnZQazExQ05UUkwtbnp5RkZHUUg3ekplOFVRbk1wUU0zS3lEZW5wbkxxRmdcIiAtLXNzaCAtLWFjY2VwdC1yb3V0ZXM7IFxcXG4gIGZpJ1xuUmVtYWluQWZ0ZXJFeGl0PXllc1xuXG5bSW5zdGFsbF1cbldhbnRlZEJ5PW11bHRpLXVzZXIudGFyZ2V0XG4iLCJlbmFibGVkIjp0cnVlLCJuYW1lIjoidGFpbHNjYWxlLWF1dGguc2VydmljZSJ9LHsiY29udGVudHMiOiJbVW5pdF1cbkRlc2NyaXB0aW9uPUZldGNoIGNvbmZpZ3VyYXRpb24gZnJvbSBPQ0kgYnVja2V0XG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgZmlyc3QtYm9vdC5zZXJ2aWNlIHRhaWxzY2FsZS1hdXRoLnNlcnZpY2UgdmFyLW9wdC1kYXRhLm1vdW50XG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblJlcXVpcmVzPWZpcnN0LWJvb3Quc2VydmljZSB2YXItb3B0LWRhdGEubW91bnRcbkJlZm9yZT1mZXRjaC1ib290c3RyYXAtc2VjcmV0cy5zZXJ2aWNlXG5Db25kaXRpb25QYXRoRXhpc3RzPSEvZXRjL2ZldGNoLWNvbmZpZy1jb21wbGV0ZVxuXG5bU2VydmljZV1cblR5cGU9b25lc2hvdFxuU3RhbmRhcmRPdXRwdXQ9am91cm5hbCtjb25zb2xlXG5TdGFuZGFyZEVycm9yPWpvdXJuYWwrY29uc29sZVxuRW52aXJvbm1lbnRGaWxlPS9ldGMvYnVja2V0L2NvbmZpZ1xuRXhlY1N0YXJ0PS9vcHQvc2NyaXB0cy9mZXRjaC1jb25maWcuc2ggJHtCVUNLRVRfTkFNRX0gJHtPQ0lfTkFNRVNQQUNFfVxuRXhlY1N0YXJ0UG9zdD0vdXNyL2Jpbi90b3VjaCAvZXRjL2ZldGNoLWNvbmZpZy1jb21wbGV0ZVxuUmVtYWluQWZ0ZXJFeGl0PXllc1xuXG5bSW5zdGFsbF1cbldhbnRlZEJ5PW11bHRpLXVzZXIudGFyZ2V0XG4iLCJlbmFibGVkIjp0cnVlLCJuYW1lIjoiZmV0Y2gtY29uZmlnLnNlcnZpY2UifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1GZXRjaCBib290c3RyYXAgc2VjcmV0cyBmcm9tIE9DSSBWYXVsdFxuQWZ0ZXI9bmV0d29yay1vbmxpbmUudGFyZ2V0IGZpcnN0LWJvb3Quc2VydmljZSBmZXRjaC1jb25maWcuc2VydmljZVxuV2FudHM9bmV0d29yay1vbmxpbmUudGFyZ2V0XG5SZXF1aXJlcz1mZXRjaC1jb25maWcuc2VydmljZVxuQmVmb3JlPWluZmlzaWNhbC1hZ2VudC5zZXJ2aWNlXG5cbltTZXJ2aWNlXVxuVHlwZT1vbmVzaG90XG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FbnZpcm9ubWVudEZpbGU9L2V0Yy9vY2ktdmF1bHQvY29uZmlnXG5FeGVjU3RhcnQ9L29wdC9zY3JpcHRzL2ZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNoXG5SZW1haW5BZnRlckV4aXQ9eWVzXG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJmZXRjaC1ib290c3RyYXAtc2VjcmV0cy5zZXJ2aWNlIn1dfX0="
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "172.16.0.18" -> (known after apply)
      + public_ip                           = (known after apply)
      ~ region                              = "uk-london-1" -> (known after apply)
      ~ security_attributes                 = {} -> (known after apply)
      ~ security_attributes_state           = "STABLE" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.uk-london-1.aaaaaaaaocb6yhiygivj4tq5yfhsyyyefivkbtmd3vtiaws5mlhu5ni2bcvq" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2026-02-24 01:01:49.652 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config (known after apply)
      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      ~ availability_config (known after apply)
      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/terraform"
              - "Oracle-Tags.CreatedOn" = "2026-02-24T01:01:49.047Z"
              - "terraform.managed"     = "terraform"
              - "terraform.name"        = "oci-apps"
              - "terraform.repo"        = "https://github.com/batinicaz/oci-apps"
            } -> (known after apply)
          ~ display_name              = "oci-apps" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          + hostname_label            = (known after apply)
          ~ private_ip                = "172.16.0.18" -> (known after apply)
          ~ security_attributes       = {} -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + subnet_cidr               = (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ launch_volume_attachments (known after apply)

      ~ licensing_configs (known after apply)

      ~ placement_constraint_details (known after apply)

      ~ platform_config (known after apply)

      ~ preemptible_instance_config (known after apply)

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 4 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 4 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          + resource_management           = (known after apply)
          ~ vcpus                         = 4 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (4 unchanged attributes hidden)

          ~ instance_source_image_filter_details (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # oci_core_volume_attachment.data must be replaced
-/+ resource "oci_core_volume_attachment" "data" {
      ~ availability_domain                 = "xykJ:UK-LONDON-1-AD-3" -> (known after apply)
      + chap_secret                         = (known after apply)
      + chap_username                       = (known after apply)
      ~ compartment_id                      = "ocid1.compartment.oc1..aaaaaaaafuvd3pcfan7vltla4vfklid2z55au5dasf4r5kkxykif3gzfyxaa" -> (known after apply)
      + device                              = (known after apply)
      ~ display_name                        = "volumeattachment20260224010225" -> (known after apply)
      + encryption_in_transit_type          = (known after apply)
      ~ id                                  = "ocid1.volumeattachment.oc1.uk-london-1.anwgiljtwlhza7ac33kdd4zsfpcjxpzaz5ituvlxyfgl7gq6f47bfaspcpkq" -> (known after apply)
      ~ instance_id                         = "ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acnmogcll3zc63p6yyihiupueffrdobd35gz5ezrjlv5vq" -> (known after apply) # forces replacement
      + ipv4                                = (known after apply)
      + ipv6                                = (known after apply)
      + iqn                                 = (known after apply)
      + is_agent_auto_iscsi_login_enabled   = (known after apply)
      + is_multipath                        = (known after apply)
      ~ is_read_only                        = false -> (known after apply)
      ~ is_shareable                        = false -> (known after apply)
      ~ is_volume_created_during_launch     = false -> (known after apply)
      + iscsi_login_state                   = (known after apply)
      ~ multipath_devices                   = [] -> (known after apply)
      + port                                = (known after apply)
      ~ state                               = "ATTACHED" -> (known after apply)
      ~ time_created                        = "2026-02-24 01:02:25.463 +0000 UTC" -> (known after apply)
      + use_chap                            = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # oci_identity_dynamic_group.this will be updated in-place
  ~ resource "oci_identity_dynamic_group" "this" {
        id             = "ocid1.dynamicgroup.oc1..aaaaaaaaxep7ntfhuk7cuhcgnmyvgjag2fhhbxoefyveb4kdz2npzrsypusq"
      ~ matching_rule  = "instance.id = 'ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acnmogcll3zc63p6yyihiupueffrdobd35gz5ezrjlv5vq'" -> (known after apply)
        name           = "oci-apps"
        # (6 unchanged attributes hidden)
    }

  # oci_load_balancer_backend.traefik must be replaced
-/+ resource "oci_load_balancer_backend" "traefik" {
      ~ drain            = false -> (known after apply)
      ~ id               = "loadBalancers/ocid1.loadbalancer.oc1.uk-london-1.aaaaaaaakgjfvnm67avsld5nuuabjxago6nwzr6ssogd5b65zgxdcwvx7xxa/backendSets/traefik/backends/172.16.0.18:80" -> (known after apply)
      ~ ip_address       = "172.16.0.18" -> (known after apply) # forces replacement
      + max_connections  = (known after apply)
      ~ name             = "172.16.0.18:80" -> (known after apply)
      ~ offline          = false -> (known after apply)
      ~ state            = "SUCCEEDED" -> (known after apply)
      ~ weight           = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/traefik.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content                    = "f415e74b325bf363120f15f6da051d71" -> "1f79575b0c62f4fcbb9dcdf13f0aa753" # forces replacement
      ~ content_length             = "576" -> (known after apply)
      ~ content_md5                = "9BXnSzJb82MSDxX22gUdcQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Ftraefik.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "54c8ff4b-d713-44f3-b625-67925ed4c2f8" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # tailscale_tailnet_key.this will be replaced due to changes in replace_triggered_by
-/+ resource "tailscale_tailnet_key" "this" {
      ~ created_at    = "2026-02-24T01:01:48Z" -> (known after apply)
      ~ expires_at    = "2026-02-24T01:11:48Z" -> (known after apply)
      ~ id            = "ko4EvrJvPk11CNTRL" -> (known after apply)
      ~ invalid       = true -> (known after apply)
      ~ key           = (sensitive value)
        tags          = [
            "tag:oci",
        ]
      + user_id       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.

```